SolderedElectronics/Dasduino-Board-Definitions-for-Arduino-IDE/Inkplate_core-1.0.0/boards.txt
##############################################################
Inkplate5.name=Inkplate 5 (ESP32)

Inkplate5.upload.tool=esptool_py
Inkplate5.upload.maximum_size=1310720
Inkplate5.upload.maximum_data_size=327680
Inkplate5.upload.wait_for_upload_port=true

Inkplate5.serial.disableDTR=true
Inkplate5.serial.disableRTS=true

Inkplate5.build.mcu=esp32
Inkplate5.build.core=Inkplate
Inkplate5.build.variant=Inkplate
Inkplate5.build.board=INKPLATE5

Inkplate5.build.f_cpu=240000000L
Inkplate5.build.flash_size=4MB
Inkplate5.build.flash_freq=40m
Inkplate5.build.flash_mode=dio
Inkplate5.build.boot=dio
Inkplate5.build.partitions=default
Inkplate5.build.defines=


Inkplate5.menu.PSRAM.enabled=Enabled
Inkplate5.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue


Inkplate5.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA)
Inkplate5.menu.PartitionScheme.huge_app.build.partitions=huge_app
Inkplate5.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Inkplate5.menu.PartitionScheme.default=Default
Inkplate5.menu.PartitionScheme.default.build.partitions=default
Inkplate5.menu.PartitionScheme.minimal=Minimal (2MB FLASH)
Inkplate5.menu.PartitionScheme.minimal.build.partitions=minimal
Inkplate5.menu.PartitionScheme.no_ota=No OTA (Large APP)
Inkplate5.menu.PartitionScheme.no_ota.build.partitions=no_ota
Inkplate5.menu.PartitionScheme.no_ota.upload.maximum_size=2097152

Inkplate5.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
Inkplate5.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
Inkplate5.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Inkplate5.menu.PartitionScheme.fatflash=16M Fat
Inkplate5.menu.PartitionScheme.fatflash.build.partitions=ffat

Inkplate5.menu.CPUFreq.240=240MHz (WiFi/BT)
Inkplate5.menu.CPUFreq.240.build.f_cpu=240000000L
Inkplate5.menu.CPUFreq.160=160MHz (WiFi/BT)
Inkplate5.menu.CPUFreq.160.build.f_cpu=160000000L
Inkplate5.menu.CPUFreq.80=80MHz (WiFi/BT)
Inkplate5.menu.CPUFreq.80.build.f_cpu=80000000L
Inkplate5.menu.CPUFreq.40=40MHz (40MHz XTAL)
Inkplate5.menu.CPUFreq.40.build.f_cpu=40000000L
Inkplate5.menu.CPUFreq.26=26MHz (26MHz XTAL)
Inkplate5.menu.CPUFreq.26.build.f_cpu=26000000L
Inkplate5.menu.CPUFreq.20=20MHz (40MHz XTAL)
Inkplate5.menu.CPUFreq.20.build.f_cpu=20000000L
Inkplate5.menu.CPUFreq.13=13MHz (26MHz XTAL)
Inkplate5.menu.CPUFreq.13.build.f_cpu=13000000L
Inkplate5.menu.CPUFreq.10=10MHz (40MHz XTAL)
Inkplate5.menu.CPUFreq.10.build.f_cpu=10000000L

Inkplate5.menu.UploadSpeed.115200=115200
Inkplate5.menu.UploadSpeed.115200.upload.speed=115200
Inkplate5.menu.UploadSpeed.921600=921600
Inkplate5.menu.UploadSpeed.921600.upload.speed=921600
Inkplate5.menu.UploadSpeed.256000.windows=256000
Inkplate5.menu.UploadSpeed.256000.upload.speed=256000
Inkplate5.menu.UploadSpeed.230400.windows.upload.speed=256000
Inkplate5.menu.UploadSpeed.230400=230400
Inkplate5.menu.UploadSpeed.230400.upload.speed=230400
Inkplate5.menu.UploadSpeed.460800.linux=460800
Inkplate5.menu.UploadSpeed.460800.macosx=460800
Inkplate5.menu.UploadSpeed.460800.upload.speed=460800
Inkplate5.menu.UploadSpeed.512000.windows=512000
Inkplate5.menu.UploadSpeed.512000.upload.speed=512000

Inkplate5.menu.DebugLevel.none=None
Inkplate5.menu.DebugLevel.none.build.code_debug=0
Inkplate5.menu.DebugLevel.error=Error
Inkplate5.menu.DebugLevel.error.build.code_debug=1
Inkplate5.menu.DebugLevel.warn=Warn
Inkplate5.menu.DebugLevel.warn.build.code_debug=2
Inkplate5.menu.DebugLevel.info=Info
Inkplate5.menu.DebugLevel.info.build.code_debug=3
Inkplate5.menu.DebugLevel.debug=Debug
Inkplate5.menu.DebugLevel.debug.build.code_debug=4
Inkplate5.menu.DebugLevel.verbose=Verbose
Inkplate5.menu.DebugLevel.verbose.build.code_debug=5

##############################################################
Inkplate6plus.name=Inkplate 6PLUS (ESP32)

Inkplate6plus.upload.tool=esptool_py
Inkplate6plus.upload.maximum_size=1310720
Inkplate6plus.upload.maximum_data_size=327680
Inkplate6plus.upload.wait_for_upload_port=true

Inkplate6plus.serial.disableDTR=true
Inkplate6plus.serial.disableRTS=true

Inkplate6plus.build.mcu=esp32
Inkplate6plus.build.core=Inkplate
Inkplate6plus.build.variant=Inkplate
Inkplate6plus.build.board=INKPLATE6PLUS

Inkplate6plus.build.f_cpu=240000000L
Inkplate6plus.build.flash_size=4MB
Inkplate6plus.build.flash_freq=40m
Inkplate6plus.build.flash_mode=dio
Inkplate6plus.build.boot=dio
Inkplate6plus.build.partitions=default
Inkplate6plus.build.defines=


Inkplate6plus.menu.PSRAM.enabled=Enabled
Inkplate6plus.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue


Inkplate6plus.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA)
Inkplate6plus.menu.PartitionScheme.huge_app.build.partitions=huge_app
Inkplate6plus.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Inkplate6plus.menu.PartitionScheme.default=Default
Inkplate6plus.menu.PartitionScheme.default.build.partitions=default
Inkplate6plus.menu.PartitionScheme.minimal=Minimal (2MB FLASH)
Inkplate6plus.menu.PartitionScheme.minimal.build.partitions=minimal
Inkplate6plus.menu.PartitionScheme.no_ota=No OTA (Large APP)
Inkplate6plus.menu.PartitionScheme.no_ota.build.partitions=no_ota
Inkplate6plus.menu.PartitionScheme.no_ota.upload.maximum_size=2097152

Inkplate6plus.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
Inkplate6plus.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
Inkplate6plus.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Inkplate6plus.menu.PartitionScheme.fatflash=16M Fat
Inkplate6plus.menu.PartitionScheme.fatflash.build.partitions=ffat

Inkplate6plus.menu.CPUFreq.240=240MHz (WiFi/BT)
Inkplate6plus.menu.CPUFreq.240.build.f_cpu=240000000L
Inkplate6plus.menu.CPUFreq.160=160MHz (WiFi/BT)
Inkplate6plus.menu.CPUFreq.160.build.f_cpu=160000000L
Inkplate6plus.menu.CPUFreq.80=80MHz (WiFi/BT)
Inkplate6plus.menu.CPUFreq.80.build.f_cpu=80000000L
Inkplate6plus.menu.CPUFreq.40=40MHz (40MHz XTAL)
Inkplate6plus.menu.CPUFreq.40.build.f_cpu=40000000L
Inkplate6plus.menu.CPUFreq.26=26MHz (26MHz XTAL)
Inkplate6plus.menu.CPUFreq.26.build.f_cpu=26000000L
Inkplate6plus.menu.CPUFreq.20=20MHz (40MHz XTAL)
Inkplate6plus.menu.CPUFreq.20.build.f_cpu=20000000L
Inkplate6plus.menu.CPUFreq.13=13MHz (26MHz XTAL)
Inkplate6plus.menu.CPUFreq.13.build.f_cpu=13000000L
Inkplate6plus.menu.CPUFreq.10=10MHz (40MHz XTAL)
Inkplate6plus.menu.CPUFreq.10.build.f_cpu=10000000L

Inkplate6plus.menu.UploadSpeed.115200=115200
Inkplate6plus.menu.UploadSpeed.115200.upload.speed=115200
Inkplate6plus.menu.UploadSpeed.921600=921600
Inkplate6plus.menu.UploadSpeed.921600.upload.speed=921600
Inkplate6plus.menu.UploadSpeed.256000.windows=256000
Inkplate6plus.menu.UploadSpeed.256000.upload.speed=256000
Inkplate6plus.menu.UploadSpeed.230400.windows.upload.speed=256000
Inkplate6plus.menu.UploadSpeed.230400=230400
Inkplate6plus.menu.UploadSpeed.230400.upload.speed=230400
Inkplate6plus.menu.UploadSpeed.460800.linux=460800
Inkplate6plus.menu.UploadSpeed.460800.macosx=460800
Inkplate6plus.menu.UploadSpeed.460800.upload.speed=460800
Inkplate6plus.menu.UploadSpeed.512000.windows=512000
Inkplate6plus.menu.UploadSpeed.512000.upload.speed=512000

