SolderedElectronics/Dasduino-Board-Definitions-for-Arduino-IDE/Inkplate_core-1.0.0/boards.txt
Inkplate6plus.menu.DebugLevel.none=None
Inkplate6plus.menu.DebugLevel.none.build.code_debug=0
Inkplate6plus.menu.DebugLevel.error=Error
Inkplate6plus.menu.DebugLevel.error.build.code_debug=1
Inkplate6plus.menu.DebugLevel.warn=Warn
Inkplate6plus.menu.DebugLevel.warn.build.code_debug=2
Inkplate6plus.menu.DebugLevel.info=Info
Inkplate6plus.menu.DebugLevel.info.build.code_debug=3
Inkplate6plus.menu.DebugLevel.debug=Debug
Inkplate6plus.menu.DebugLevel.debug.build.code_debug=4
Inkplate6plus.menu.DebugLevel.verbose=Verbose
Inkplate6plus.menu.DebugLevel.verbose.build.code_debug=5

##############################################################
Inkplatecolor.name=Inkplate 6COLOR (ESP32)

Inkplatecolor.upload.tool=esptool_py
Inkplatecolor.upload.maximum_size=1310720
Inkplatecolor.upload.maximum_data_size=327680
Inkplatecolor.upload.wait_for_upload_port=true

Inkplatecolor.serial.disableDTR=true
Inkplatecolor.serial.disableRTS=true

Inkplatecolor.build.mcu=esp32
Inkplatecolor.build.core=Inkplate
Inkplatecolor.build.variant=Inkplate
Inkplatecolor.build.board=INKPLATECOLOR 

Inkplatecolor.build.f_cpu=240000000L
Inkplatecolor.build.flash_size=4MB
Inkplatecolor.build.flash_freq=40m
Inkplatecolor.build.flash_mode=dio
Inkplatecolor.build.boot=dio
Inkplatecolor.build.partitions=default
Inkplatecolor.build.defines=


Inkplatecolor.menu.PSRAM.enabled=Enabled
Inkplatecolor.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue


Inkplatecolor.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA)
Inkplatecolor.menu.PartitionScheme.huge_app.build.partitions=huge_app
Inkplatecolor.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Inkplatecolor.menu.PartitionScheme.default=Default
Inkplatecolor.menu.PartitionScheme.default.build.partitions=default
Inkplatecolor.menu.PartitionScheme.minimal=Minimal (2MB FLASH)
Inkplatecolor.menu.PartitionScheme.minimal.build.partitions=minimal
Inkplatecolor.menu.PartitionScheme.no_ota=No OTA (Large APP)
Inkplatecolor.menu.PartitionScheme.no_ota.build.partitions=no_ota
Inkplatecolor.menu.PartitionScheme.no_ota.upload.maximum_size=2097152

Inkplatecolor.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
Inkplatecolor.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
Inkplatecolor.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Inkplatecolor.menu.PartitionScheme.fatflash=16M Fat
Inkplatecolor.menu.PartitionScheme.fatflash.build.partitions=ffat

Inkplatecolor.menu.CPUFreq.240=240MHz (WiFi/BT)
Inkplatecolor.menu.CPUFreq.240.build.f_cpu=240000000L
Inkplatecolor.menu.CPUFreq.160=160MHz (WiFi/BT)
Inkplatecolor.menu.CPUFreq.160.build.f_cpu=160000000L
Inkplatecolor.menu.CPUFreq.80=80MHz (WiFi/BT)
Inkplatecolor.menu.CPUFreq.80.build.f_cpu=80000000L
Inkplatecolor.menu.CPUFreq.40=40MHz (40MHz XTAL)
Inkplatecolor.menu.CPUFreq.40.build.f_cpu=40000000L
Inkplatecolor.menu.CPUFreq.26=26MHz (26MHz XTAL)
Inkplatecolor.menu.CPUFreq.26.build.f_cpu=26000000L
Inkplatecolor.menu.CPUFreq.20=20MHz (40MHz XTAL)
Inkplatecolor.menu.CPUFreq.20.build.f_cpu=20000000L
Inkplatecolor.menu.CPUFreq.13=13MHz (26MHz XTAL)
Inkplatecolor.menu.CPUFreq.13.build.f_cpu=13000000L
Inkplatecolor.menu.CPUFreq.10=10MHz (40MHz XTAL)
Inkplatecolor.menu.CPUFreq.10.build.f_cpu=10000000L

Inkplatecolor.menu.UploadSpeed.115200=115200
Inkplatecolor.menu.UploadSpeed.115200.upload.speed=115200
Inkplatecolor.menu.UploadSpeed.921600=921600
Inkplatecolor.menu.UploadSpeed.921600.upload.speed=921600
Inkplatecolor.menu.UploadSpeed.256000.windows=256000
Inkplatecolor.menu.UploadSpeed.256000.upload.speed=256000
Inkplatecolor.menu.UploadSpeed.230400.windows.upload.speed=256000
Inkplatecolor.menu.UploadSpeed.230400=230400
Inkplatecolor.menu.UploadSpeed.230400.upload.speed=230400
Inkplatecolor.menu.UploadSpeed.460800.linux=460800
Inkplatecolor.menu.UploadSpeed.460800.macosx=460800
Inkplatecolor.menu.UploadSpeed.460800.upload.speed=460800
Inkplatecolor.menu.UploadSpeed.512000.windows=512000
Inkplatecolor.menu.UploadSpeed.512000.upload.speed=512000

Inkplatecolor.menu.DebugLevel.none=None
Inkplatecolor.menu.DebugLevel.none.build.code_debug=0
Inkplatecolor.menu.DebugLevel.error=Error
Inkplatecolor.menu.DebugLevel.error.build.code_debug=1
Inkplatecolor.menu.DebugLevel.warn=Warn
Inkplatecolor.menu.DebugLevel.warn.build.code_debug=2
Inkplatecolor.menu.DebugLevel.info=Info
Inkplatecolor.menu.DebugLevel.info.build.code_debug=3
Inkplatecolor.menu.DebugLevel.debug=Debug
Inkplatecolor.menu.DebugLevel.debug.build.code_debug=4
Inkplatecolor.menu.DebugLevel.verbose=Verbose
Inkplatecolor.menu.DebugLevel.verbose.build.code_debug=5

##############################################################
